Tekla.Structures.ModelInternal.PolymeshInterop
Helper class to convert polymesh instances of various types.

Tekla.Structures.ModelInternal.PolymeshInterop.ConvertToStruct(Tekla.Structures.Geometry3d.FacetedBrep,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a FacetedBrep to polymesh struct.
input:
The input parameter.
output:
The output parameter.

Tekla.Structures.ModelInternal.PolymeshInterop.Convert(Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a struct of polymeshes to a list of FacetedBrep.
input: The input parameter
Returns: The converted polymesh instances